Repository: giellalt/corpus-nob
Catalog: prestable/tmx/sme/facta/skuvlahistorja6/saraelle-n.html.tmx
Source language: nob
Languages: sme

source: I det prosjektet var det meningen at ungdomsskolelærere skulle være aktivt med, å hjelpe studentene med den pedagogiske biten, og studentene skulle lære elevene bruken av IKT. Dessverre var det få lærere vi så før fremføringa.
sme: Dien nuoraidskuvlaprošeavttas lei oaivil ahte Guovdageainnu nuoraidskuvlla oahpaheaddjit galge leat mielde aktiivvalaččat, studeanttaide veahkkin pedagogihka bealis, ja studeanttat fas oahpahit ohppiide DGT-beali, muhto nuoraidskuvlla oahpaheaddjit gal eai báljo oba oidnonge ovdal ovdanbuktima.

source: Både vi studenter og elevene var litt skuffet over ungdomsskolelærerne.
sme: Sihke mii studeanttat ja oahppit gal leimmet beahtahallan nuoraidskuvlla oahpaheddjiide.

source: Praksis i flerkulturell skole
sme: Hárjehallan máŋggakultuvrrat skuvllas

source: Tredje året hadde vi praksis i Melkevarden skole i Vadsø.
sme: Goalmmát jagi lei hárjehallan Mielgavári (Melkevarden) skuvllas, Čáhcesullos.

source: Det var også en skoleadopsjon.
sme: Dat lei maid skuvlaadopšuvdna.

source: Melkevarden skole var en slik skole hvor elevene kom fra forskjellige land.
sme: Mielgavári skuvla lei dakkár skuvla gos ledje oahppit iešguđetge riikkain boahtán.

source: Noen av dem hadde ikke vært så lenge i Norge, og kunne dermed ikke så godt norsk.
sme: Muhtumat sis eai lean leamaš nu guhká Norggas, ja eai máhttán vel nu bures dárogiela.

source: Derfor var det litt utfordrende å undervise der.
sme: Danin lei oalle hástalus doppe oahpahit.

source: Spesielt når man ikke kjente til elevenes bakgrunn fra før og det var ingen vi kunne spørre.
sme: Earenoamážit go in lean veaháge oahpis ohppiid duogážii iige lean oktage geas sáhtii jearrat.

source: Selv om vi måtte holde undervisninga på norsk, så lærte vi elevene samiske barnesanger og fortalte samiske eventyr og lærte dem noen samiske leker.
sme: Vaikko fertiimet oahpahit dárogillii, de oahpaheimmet ohppiide sámi mánáidlávlagiid ja muitaleimmet sámi máidnasiid, ja oahpaheimmet sámi stohkosiid.

source: Det kan være vanskelig å bo sammen med mange andre studenter i flere uker, men jeg var så heldig at jeg fikk bo sammen med tre andre jenter i en liten leilighet og vi hadde det veldig fint og kveldene gikk fort.
sme: Sáhttá leat oalle hástalus orrut ovttas máŋggain eará studeanttain máŋga vahku, muhto mus lei nu lihkku ahte orron ovttas golmmain eará nieiddain unnit ásodagažis, ja mis lei hui fiinna dilli, ja eahkedat manne hui jođánit.

source: Det fjerde året var praksisperioden totalt forandret. Den var organisert slik at vi hadde praksis en uke av gangen og i mellomtiden hadde vi forelesninger og fagdager på høgskolen.
sme: Njealját jagi lei hárjehallan rievdan oalát, ja lei organiserejuvvon nu ahte lei vahkku ain hávális hárjehallan ja gaskkohagaid lei oahpaheapmi dehe ledje fágabeaivvit allaskuvllas.

source: Den type praksis var spesielt lærerikt for studentene, for da oppdaget vi bedre sammenhengen mellom teori og praksis.
sme: Diet málle čađahit hárjehallama lei earenoamáš buorre ja de studeanta fuomášii buorebut teoriija ja praktihka oktavuođa.

source: Det var også veldig bra at praksisveilederne ble invitert til disse fagdagene.
sme: Lei maid hui buorre go hárjehallanbagadallit bovdejuvvojedje daidda fágabeivviide.

source: Praksisseminaret ble alltid holdt etter en praksisperiode og det var lærerikt å få se hva de andre gruppene hadde opplevd og lært.
sme: Hárjehallanseminára dollui juohke hárjehallama maŋŋel ja lei ávkkálaš oaidnit maid eará joavkkut ledje vásihan ja oahppan.

source: Det var alltid for lite tid til planlegginga av praksisperioden og ofte måtte vi sitte oppe til langt på kveld med planlegginga etter at vi kom frem til praksisplassen.
sme: Hárjehallamiid plánemii lei álo beare unnán áigi ja go olliimet hárjehallanbáikkiide de fertiimet dávjá eahketbottaid vel bargat plánenbargguiguin.

source: På mange av praksisene savnet jeg en veileder.
sme: Mun váillahin máŋgga hárjehallamis bagadalliid.

source: Vi hadde mange skoleadopsjoner og i skoleadopsjonene var det ikke praksisveiledere.
sme: Mis ledje máŋga adopšuvnna ja adopšuvnnas ii leat hárjehallanbagadalli.

source: Den første ordentlige praksisen og det første ungdomsskoleprosjektet var uten praksisveiledere.
sme: Vuosttaš albma hárjehallan ja vuosttaš nuoraidskuvlaprošeakta lei hárjehallanbagadalliid haga.

source: Jeg mener at man skulle ha ventet med adopsjon til 3. eller 4. studieåret, for da hadde vi vært mer på praksis, og lest litt flere fag og pedagogikk.
sme: Mu mielas lei galgat skuvlaadopšuvnnaiguin vuordit juobe 3. dehe 4. oahppojahkái, go de livččiimet hárjánan eambbo ja lohkan eambbo sihke fágaid ja pedagogihka.

source: Forhåpentligvis har vi ikke gjort så mye galt i skoleadopsjonene og gjort noe skade på de stakkars elevene.
sme: Sávvamis eat leat nu beare boastut bargan skuvlaadopšuvnnain ja maide vahágiid dagahan oahppiriebuide.

source: Mot slutten av det første året fødte jeg en gutt, men jeg valgte likevel å forsette studiene.
sme: Njuoratmánná skuvllas Vuosttaš oahppojagi giđa mun riegádahtten máná, muhto dattetge čađahin oahpu.

source: I læremiddelpedagogikk laga vi en film om snarefangst på ryper som vi brukte som læremiddel når vi var på praksis.
sme: Oahpponeavvopedagogihkas mii ráhkadeimmet filmma rievssatgárduma birra, maid mii aniimet oahpponeavvun hárjehallamis.

source: Jeg husker jeg var svær når vi var ute å filma og det var så tungt å vasse i dypsnøen.
sme: Muittán ahte ledjen oalle gassat go filbmiimet ja lei oba lossat obbasa gállit.

source: Det gikk nå bra, filmen ble ferdig og elevene likte et litt mer moderne læremiddel.
sme: Manai goitge bures, filbma válbmanii ja oahppit liikojedje ođđamállet oahpponevvui.

source: Husker da på slutten av skoleåret, vi hadde fått en større skriftlig oppgave.
sme: Muittán loahpageahčen skuvlajagi, go leimmet ožžon bargun guhkebuš čállosa čállit.

source: Vi var to studenter som skulle jobbe sammen.
sme: Moai leimme guokte studeantta geat barggaime ovttas.

source: Det gikk mot helg og vi var slitne og leie.
sme: Lei juo vahkkoloahpa guvlui manneme, ja váiban dieđusge dainna bargguin.

source: Jeg foreslo at vi kunne fortsette på mandag, men det ville hun ikke. Hun hintet da om at jeg kanskje ikke kom på skolen på mandag.
sme: Mun árvalan ean go mánnodahkii vuordde loahppabargguin, muhto ii son dan háliidan, ja árvala vel ahte in mun dalle dáidde leat skuvllas.

source: Og slik gikk det.
sme: Ja nu šattai ge.

source: Jeg tok sommerferie samme søndag, for da fikk jeg en gutt.
sme: Geavai nu ahte válden geasseluomu seamma sotnabeaivvi, go dalle ožžon unna bártnáža.

source: Andre studieåret hadde jeg en baby med på skolen.
sme: Nuppi oahppojagi lei mus njuoratmánná.

source: Jeg brukte å ta ham med på høstsemesteret, og han sov nesten hele dagen på skolen.
sme: Mun lávejin váldit su mielde skuvlii čakčalohkanbajis, ja son ođii eanas áiggi skuvllas.

source: På vårparten sov han ikke så mye lenger og da måtte bestemødrene stille opp som dagmamma, mens jeg var på skolen.
sme: Giđđalohkanbajis son ii šat oađđán nu njálgát skuvllas, ja fertii áhkuid luhtte leat skuvlabotta. Bargovuogit

source: Det var veldig forskjellige arbeidsmetoder i lærerutdanninga.
sme: Oahpaheaddjioahpus ledje olu iešguđet lágan bargovuogit.

source: Til praksis knyttet vi alle fag vi enten hadde gjennomført eller hadde inneværende skoleår.
sme: Hárjehallamiidda čanaimet buot fágaid maid leimmet juogo čađahan dehe maid leimmet dan jagi lohkame.

source: Mens vi gikk på lærerutdanninga, hadde vi flere mindre prosjekter, og jeg tror vi lærte mer gjennom dette enn det vi hadde gjort hvis vi bare hørt om dette i teoretiske fag.
sme: Dan botta go mii logaimet oahpaheaddjioahpu, de ledje mis máŋga smávit prošeavtta, ja jáhkán ahte leat oahppan das eambbo go maid livččiimet dahkan jus dušše livččiimet gullan daid teoriijaid birra.

source: Vi har i hvert fall fått prøve oss på litt av hvert, og opplevd veldig mye i løpet av utdanningstiden.
sme: Mii leat goit beassan geahččaladdat feara maid ja leat vásihan olu oahppama áigodagas.

source: Min oppfordring til nye studenter er at de må ta godt i mot og være positivt innstilt til prosjekter og nye arbeidsmetoder, selv om nye prosjekter krever en del ressurser, så lærer man veldig mye av dette både å kjenne og forstå bedre om det som går på det faglige og det menneskelige.
sme: Mu ávžžuhus ođđa studeanttaide lea ahte galget bures váldit vuostá prošeavttaid ja ođđa bargovugiid. Vaikko vel ođđa prošeavttat gáibidit ollu návccaid, de dain oahppá maid hui ollu sihke fága áššiid ja olmmošlaš beliid dovdat ja ipmirdit.

source: Samisk perspektiv
sme: Sámi perspektiiva

source: Samisk perspektiv var ivaretatt i alle fagene, og det opplevdes som meget bra å få opplæring på samisk, selv om en god del av lærebøkene var på norsk.
sme: Sámi perspektiiva čuovui buot oahpuid ja lei earenoamáš buorre beassat oahppat sámegillii, vaikko olu oahppogirjjit ledje dárogillii.

source: IKT og tradisjonell samisk kunnskap var en del av alle fag og alle praksiser.
sme: DGT ja sámi árbevirolaš máhttu čuovui juohke fága ja juohke hárjehallama.

source: I læremiddelpedagogikk laget vi film om snarefangst av ryper, en film om notfiske, et digitalt læremiddel om samisk kunst og litteratur, og ei framføring om reindrift.
sme: Oahpponeavvopedagogihkas ráhkadeimmet gárdunfilmma, nuohttunfilmma, digitála oahpponeavvu sámi dáidaga ja girjjálašvuođa birra, ja maid ovtta ovdanbuktima boazodoalu birra.

source: I pedagogikk diskuterte vi mye om hva og hvordan samisk pedagogikk er.
sme: Pedagogihkas ságastalaimet olu dan birra mii ja makkár sámi pedagogihkka lea.

source: I samiskfaget, i emnet folkediktning, skrev vi om utbor og underjordiske, og andre slike fenomener som hører til samisk liv.
sme: Sámegielas, álbmotdiktemis, čáliimet eahpáraččaid ja ulddaid birra, ja eará dakkár fenomenaid mat gullet sámi eallimii.

source: I natur- og samfunnsfag var det også mye snakk om samisk historie og levekår.
sme: Luondu-, servodat- ja birasoahpus lei maid sámi historjjá ja birgejumi birra olu sáhka.

source: Grunnlag i opplæringa var samiske områder, levemåter og livsvilkår.
sme: Oahpahus válddii vuođu sámi guovlluin, eallinvugiin ja birgejumis.

source: Selv om vi studenter synes det vi lærte var dagligdagse saker, så fikk vi allikevel et annet perspektiv til disse sakene, og jeg opplevde at tradisjonell samisk kunnskap ble verdsatt på høgskolen.
sme: Vaikko min studeanttaid mielas orro leame árgabeaiáššit maid oahpaimet, de goitge oaččuimet eará perspektiivva dáidda áššiide ja mun dovden ahte sámi árbevirolaš máhttu árvvusadnui allaskuvllas.

source: Jeg husker at en gang var Odd Mathis Hætta der og holdt foredrag om gammel samisk folketro.
sme: Muittán Odd Mathis Hætta lei oktii logaldallame sámi dološ oskku birra.

source: For meg var dette veldig interessant.
sme: Hui miellagiddevaš mu mielas.

source: I duodji lærte vi selvsagt mest om samisk duodji, men vi hadde også litt farge- og tegneopplæring.
sme: Duojis diehttelasat oahpaimet eanemusat sámi duoji birra, muhto lei maid veahá ivdne- ja tevdnenoahppa.

source: I det hele tatt hadde lærerutdanninga solid samisk perspektiv, både i fagene og i prosjektene.
sme: Obbalaččat lei oahpaheaddjioahpus hui nana sámi perspektiiva, sihke fágain ja prošeavttain.
